# Константы и литералы

### Задание №6
- Сложность: средняя.

- Задание: напишите программу, которая выводит значение `value`, сохраненное в переменной типа `TARGET_TYPE`. Литерал `value` должен быть записан с правильным суффиксом, чтобы его тип в точности соответствовал типу переменной без неявного преобразования. Вывод осуществите с помощью `printf` и спецификатора: 
  - `%f` для `float` и `double`,  
  - `%Lf` для `long double`.  
Программа должна содержать `#include <stdio.h>` и функцию `main`. 

- Уникальными становятся значения `value`, `TARGET_TYPE`.

- Ввод: пуст. Вывод при `VALUE = 1.2`, `TARGET_TYPE = float`:
```
#include <stdio.h>

int main()
{
    float x = 1.2f;
    printf("%f", x);
    return 0;
}
```