# Ввод и вывод

### Задание №5
- Сложность: легкая.

- Задание: напишите программу, которая считывает строку (не более 100 символов) из стандартного ввода с помощью функции `function` и выводит эту же строку на экран. Требования:    
  - Программа должна использовать ровно одну функцию ввода .   
  - На стандартный вход подается строка `str` (одно слово, без пробелов и без символа перевода строки).  
- Вывести прочитанную строку с помощью `printf("%s", ...)`.

- Уникальными становятся значения `function` (`scanf`, `gets` или `fgets`), `str`.

- Ввод: пуст. Вывод при `function = fgets`, `str = hello`:
```
#include <stdio.h>

int main()
{
    char buf[100];
    fgets(buf, 100, stdin);
    printf("%s", buf);
    return 0;
}
```