# Функции и процедуры

### Задание №4
- Сложность: сложная.

- Задание: напишите программу, которая вычисляет значение квадратного многочлена `P(x) = a * x^2 + b * x + c` в точке `x`. В программе должны быть определены две inline-функции:  
  - `int sq(int x)` - возвращает квадрат числа `x`;  
  - `int mul(int a, int b)` - возвращает произведение `a * b`.  
В функции `main` необходимо:  
- вычислить `A * sq(x) + B * x + C`, используя `sq` и `mul`;  
- вывести полученное целое число (можно с переводом строки `\n`).     

- Уникальными становятся значения `A`, `B`, `C`, `x`.

- Ввод: пуст. Вывод при `A = 2`, `B = -3`, `C = 5`, `x = 4`:
```
#include <stdio.h>

inline int sq(int x)
{
    return x * x;
}

inline int mul(int a, int b)
{
    return a * b;
}

int main()
{
    int a = 2, b = -3, c = 5, x = 4;
    int result = mul(a, sq(x)) + mul(b, x) + c;
    printf("%d", result);
    return 0;
}
```