# Управляющие конструкции

### Задание №6
- Сложность: средняя.

- Задание: напишите программу, которая вычисляет сумму цифр положительного целого числа `n`. В программе обязательно должен использоваться цикл `do-while` для последовательного выделения цифр числа. Запрещается использовать массивы, строки, рекурсию или функции ввода-вывода, кроме printf для вывода результата. Полученную сумму нужно вывести на экран (только число, можно с переводом строки). 

- Уникальными становятся значения `n`.

- Ввод: пуст. Вывод при `n = 1313`:
```
#include <stdio.h>

int main()
{
    int n = 1313
    int sum = 0;
    do {
        sum += n % 10;
        n /= 10;
    } while (n > 0);
    printf("%d", sum);
    return 0;
}
```