# Управляющие конструкции

### Задание №7
- Сложность: средняя.

- Задание: напишите программу, которая вычисляет сумму всех целых чисел от `1` до `M` включительно, которые делятся нацело на `K`. Ограничения:
  - В программе обязательно использовать цикл for для перебора чисел от `1` до `M`.
  - Запрещается применять массивы, функции ввода (кроме вывода результата), рекурсию.
  - Вывести на экран только итоговую сумму (целое число, допустимо с переводом строки \n).
  - Программа должна содержать `#include <stdio.h>` и функцию `main`. 

- Уникальными становятся значения `M`, `K`.

- Ввод: пуст. Вывод при `M = 13`, `K = 2`:
```
#include <stdio.h>

int main()
{
    int m = 13;
    int k = 2;
    int sum = 0;
    for (int i = 1; i <= m; i++) {
        if (i % k == 0) {
            sum += i;
        }
    }
    printf("%d", sum);
    return 0;
}
```