# Базовые типы данных

### Задание №14
- Сложность: сложная.

- Задание: напишите программу, которая сравнивает два вещественных числа двойной точности с заданной погрешностью. Программа должна содержать `#include <stdio.h>`, `#include <math.h>` и функцию `main`. Логика сравнения:  
 - переменной `a` присвоить значение `A`;  
 - переменной `b` присвоить значение `B`;  
 - переменной `eps` присвоить значение `EPS`;  
 - если `fabs(a - b) < eps`, вывести `"yes"`, иначе вывести `"no"` (без кавычек).    

- Уникальными становятся значения `A`, `B`, `EPS`.

- Ввод: пуст. Вывод при `A=0.42`, `B=0.44`, `EPS = 1e-9`: 
```
#include <stdio.h>
#include <math.h>

int main()
{
    double a = 0.42;
    double b = 0.44;
    double eps = 1e-9;
    if (fabs(a - b) < eps)
        printf("yes");
    else
        printf("no");
    return 0;
}
```