# Переменные и области видимости

### Задание №1
- Сложность: сложная.

- Задание: напишите программу, которая выводит сумму двух целых чисел `X` и `Y`. Обязательные требования:
  - В программе должны быть две разные локальные переменные с одинаковым именем `num`. Каждая из них объявляется в своём блоке (внутри `main`). В одном блоке `num` присваивается значение `X`, в другом — значение `Y`. Блоки не должны пересекаться.
  - Должна быть еще одна переменная (например, `sum`), в которую накапливается сумма.
  - Программа должна содержать `#include <stdio.h>` и функцию `main`.
  - Вывод осуществляется функцией `printf` со спецификатором `%d` (только число, можно с переводом строки `\n`).
  - Использовать глобальные переменные или другие имена для разных сущностей запрещено - только `num` для хранения чисел в блоках. 

- Уникальными становятся значения `X` и `Y`.

- Ввод: пуст. Вывод при `X = 5`, `Y = 10`:
```
#include <stdio.h>

int main()
{
    int sum = 0;
    {
        int num = 5;
        sum += num;
    }
    {
        int num = 10;
        sum += num;
    }
    printf("%d\n", sum);
    return 0;
}
```