# Управляющие конструкции

### Задание №9
- Сложность: сложная.

- Задание: напишите программу, которая вычисляет сумму первых `N` членов двух арифметических прогрессий, используя один цикл `for` с двумя счетчиками. Прогрессии задаются:  
  - первая: начальное значение `A`, шаг `A_STEP`;  
  - вторая: начальное значение `B`, шаг `B_STEP`.  
Требования:  
  - В программе должен быть ровно один цикл `for`, в заголовке которого объявлены и изменяются две переменные (по одной для каждой прогрессии).  
  - Цикл выполняется `N` раз.  
  - На каждой итерации к общей сумме прибавляются текущие значения обеих прогрессий.  
  - Вывести итоговую сумму (целое число, допустимо с переводом строки `\n`).   

- Уникальными становятся значения `A`, `A_STEP`, `B`, `B_STEP`, `N`.

- Ввод: пуст. Вывод при `A = 2`, `A_STEP = 3`, `B = 5`, `B_STEP = 2`, `N = 3`:
```
#include <stdio.h>

int main()
{
    int a0 = 2, a_step = 3;
    int b0 = 5, b_step = 2;
    int n = 3;
    int sum = 0;
    for (int i = 0, a = a0, b = b0; i < n; i++, a += a_step, b += b_step)
    {
        sum += a + b;
    }
    printf("%d", sum);
    return 0;
}
```