# Константы и литералы

### Задание №4
- Сложность: средняя.

- Задание: напишите программу, которая выводит на экран число `value`, используя функцию `printf` со спецификатором `%d`. Важное условие: в исходном коде значение, передаваемое в `printf`, должно быть записано не десятичным литералом, а литералом в `param` системе счисления (Вы должны сами получить его, зная `value`). Программа должна содержать только `#include <stdio.h>` и функцию `main`. Не допускается использование переменных, математических операций или вызовов функций, кроме `printf`. Используйте непосредственно литерал с правильным префиксом (`0` для восьмеричной, `0x` для шестнадцатеричной). 

- Уникальными становятся значения `value` и `param` (восьмеричная или шестнадцатеричная сс).

- Ввод: пуст. Вывод при `value = 13`, `param = шестнадцатеричная`: 
```
#include <stdio.h>

int main()
{
    printf("%d", 0xD);
    return 0;
}
```