# Переменные и области видимости

### Задание №2
- Сложность: сложная.

- Задание: напишите программу, которая выводит сумму двух целых чисел `A` и `B`. Обязательные требования:
  - В программе должна быть глобальная переменная `val`, инициализированная значением `A`.
  - Внутри `main` должна быть локальная переменная с тем же именем `val`, инициализированная значением `B`.
  - Не используйте других глобальных переменных.
  - Для доступа к глобальной `val` до ее перекрытия локальной можно сохранить значение в дополнительную переменную (например, `temp`).
  - Вывод осуществляется функцией `printf` со спецификатором `%d` (только число, можно с `\n`).
  - Программа должна содержать `#include <stdio.h>` и функцию `main`. 

- Уникальными становятся значения `A` и `B`.

- Ввод: пуст. Вывод при `A = 7`, `B = 15`:
```
#include <stdio.h>

int val = 7;

int main()
{
    int temp = val;
    int val = 15;
    printf("%d\n", temp + val);
    return 0;
}
```