# Выражения и операторы

### Задание №9
- Сложность: средняя.

- Задание: напишите программу, которая:
  - объявляет целочисленную переменную `val` и инициализирует ее значением `value`;
  - выполняет над ней последовательно три операции в строго указанном порядке:
    1. val `operation1`= OP1
    2. val `operation2`= OP2
    3. val `operation3`= OP3
  - выводит итоговое значение `val` с помощью `printf("%d", val);` (можно добавить `\n`). 

- Уникальными становятся значения `value`, `operation1` (`+ или *`), `operation2` (`- или /`), `operation3` (`% или -`), `OP1`, `OP2`, `OP3`.

- Ввод: пуст. Вывод при `value = 13`, `operation1 = +`, `operation2 = /`, `operation3 = -`, `OP1 = 3`, `OP2 = 4`, `OP3 = 4`:
```
#include <stdio.h>

int main()
{
    int val = 13;
    val += 3;
    val /= 4;
    val -= 4;
    printf("%d", val);
    return 0;
}
```