# Управляющие конструкции

### Задание №11
- Сложность: сложная.

- Задание: напишите программу, которая вычисляет наибольший общий делитель (НОД) двух натуральных чисел `A` и `B` по алгоритму Евклида с вычитанием. Требования:  
- В программе обязательно использовать ключевое слово `goto` для организации повторяющихся действий.  
- Запрещается применять циклы `for`, `while`, `do-while`.  
- Вывести полученный НОД (только число, можно с переводом строки `\n`).   

- Уникальными становятся значения `A`, `B`.

- Ввод: пуст. Вывод при `A = 12`, `B = 8`:
```
#include <stdio.h>

int main()
{
    int a = 12, b = 8;
loop:
    if (a == b) goto end;
    if (a > b)
    {
        a = a - b;
    } 
    else
    {
        b = b - a;
    }
    goto loop;
end:
    printf("%d", a);
    return 0;
}
```