# Константы и литералы

### Задание №7
- Сложность: средняя.

- Задание: напишите программу, которая выводит на экран `operation` двух констант `a` и `b`. Константы `a` и `b` должны быть объявлены с ключевым словом `const` и инициализированы значениями `A` и `B` соответственно. Программа должна содержать `#include <stdio.h>` и функцию `main`. Вывод должен осуществляться с помощью `printf` и содержать только число. 

- Уникальными становятся значения `operation` (произведение, сумму, разность), `A`, `B`.

- Ввод: пуст. Вывод при `operation = произведение`, `A = 3`, `B = 5`:
```
#include <stdio.h>

int main()
{
    const int a = 3;
    const int b = 5;
    printf("%d\n", a * b);
    return 0;
}
```