# Базовые типы данных

### Задание №12
- Сложность: сложная.

- Задание: напишите программу, которая выводит на экран минимальное и максимальное значение вещественного типа `TYPENAME`, используя соответствующие макросы из `<float.h>`. Программа должна содержать `#include <stdio.h>`, `#include <float.h>` и функцию `main`. Спецификаторы формата для `printf`:
 - для `float` — `%e`;
 - для `double` — `%e`;
 - для `long double` — `%Le`.
Вывод должен состоять из двух чисел, разделенных пробелом, и заканчиваться символом перевода строки.   

- Уникальными становятся значения `TYPENAME` (`float`, `double`, `long double`).

- Ввод: пуст. Вывод при `TYPENAME = double`:
```
#include <stdio.h>
#include <float.h>

int main() {
    printf("%e %e\n", DBL_MIN, DBL_MAX);
    return 0;
}
```