# Выражения и операторы

### Задание №10
- Сложность: сложная.

- Задание: напишите программу, которая выводит число, определяющее результат сравнения двух целых чисел `A` и `B`:  
  - вывести `-1`, если `A < B`;  
  - вывести `0`, если `A == B`;  
  - вывести `1`, если `A > B`.  
Ограничения:
  - В программе запрещено использовать условные операторы (`if`, `switch`, тернарный оператор `?:`).  
  - Разрешается использовать только операторы сравнения и арифметические операции (в том числе логические, которые дают `0` или `1`).  
  - Программа должна содержать `#include <stdio.h>` и функцию `main`.  
  - Вывод осуществляется с помощью `printf`. 

- Уникальными становятся значения `A`, `B`.

- Ввод: пуст. Вывод при `A = 5`, `B = 3`:
```
#include <stdio.h>

int main()
{
    printf("%d", (5 > 3) - (5 < 3));
    return 0;
}
```