# Управляющие конструкции

### Задание №8
- Сложность: средняя.

- Задание: напишите программу, которая вычисляет сумму всех целых чисел от `1` до `M` включительно. При этом необходимо обязательно использовать цикл `for`, в котором опущены все три части (то есть заголовок выглядит как `for (;;))`. Выход из цикла должен быть реализован с помощью if и break. Программа должна содержать `#include <stdio.h>` и функцию `main`. Вывести на экран нужно только полученную сумму (можно с символом перевода строки \n). 

- Уникальными становятся значения `M`.

- Ввод: пуст. Вывод при `M = 13`:
```
#include <stdio.h>

int main()
{
    int i = 1;
    int sum = 0;
    for (;;)
    {
        sum += i;
        i++;
        if (i > 13) break;
    }
    printf("%d\n", sum);
    return 0;
}
```