# Ввод и вывод

### Задание №6
- Сложность: легкая.

- Задание: напишите программу, которая считывает с помощью `scanf` три значения: целое число `a`, символ операции `op` и целое число `b`. Программа должна вычислить результат арифметической операции `a op b` и вывести его на экран. Поддерживаемые операции: `+` (сложение), `-` (вычитание), `*` (умножение), `/` (целочисленное деление). При делении на ноль вывести строку `Division by zero` (без кавычек). Если получена неизвестная операция, выведите: `Invalid operator`. Ввод данных: числа и знак разделяются пробельными символами, знак операции не является пробелом. Вывод: одно целое число или указанная строка ошибки.  

- Уникальных значений нет.

- Ввод: `a op b`. Вывод: результат операции. Пример программы:
```
#include <stdio.h>

int main()
{
    int a, b;
    char op;
    scanf("%d %c %d", &a, &op, &b);
    switch (op)
    {
        case '+': printf("%d", a + b); break;
        case '-': printf("%d", a - b); break;
        case '*': printf("%d", a * b); break;
        case '/':
            if (b != 0)
                printf("%d", a / b);
            else
                printf("Division by zero");
            break;
        default:
            printf("Invalid operator");
    }
    return 0;
}
```