# Базовые типы данных

### Задание №15
- Сложность: сложная.

- Задание: напишите программу, которая определяет, является ли значение переменной `x` (равной `value`) NaN, бесконечностью или конечным числом, и выводит соответственно `"nan"`, `"inf"` или `"finite"`. Использовать функции isnan, isinf, fpclassify и другие из <math.h> запрещается. Программа должна опираться только на свойства арифметических операций и сравнений языка Си.
Обязательно подключить #include <stdio.h> и реализовать функцию `main`.    

- Уникальными становятся значения `value`.

- Ввод: пуст. Вывод при `value = 0.0/0.0`: 
```
#include <stdio.h>

int main()
{
    float x = 0.0/0.0;
    if (x != x)
        printf("nan");
    else 
    {
        if (x == x + 1.0)
            printf("inf");
        else
            printf("finite");
    }
    return 0;
}
```