# Управляющие конструкции

### Задание №5
- Сложность: сложная.

- Задание: напишите программу, которая по заданному номеру месяца (целое число `M`) выводит количество дней в этом месяце для невисокосного года. Требования:
  - Используйте оператор `switch`.
  - Cгруппируйте месяцы с одинаковым количеством дней с помощью проваливания (fallthrough) - не ставьте `break` между такими `case`, а общий `printf` разместите в конце группы.
  - Предусмотрите вывод `"Invalid"` при некорректном номере месяца.
  - Программа должна содержать #include <stdio.h> и функцию `main`. 

- Уникальными становятся значения `M`.

- Ввод: пуст. Вывод при `M = 11`:
```
#include <stdio.h>

int main()
{
    int month = 11;
    switch (month)
    {
        case 1: case 3: case 5: case 7: case 8: case 10: case 12:
            printf("31"); break;
        case 4: case 6: case 9: case 11:
            printf("30"); break;
        case 2:
            printf("28"); break;
        default:
            printf("Invalid");
    }
    return 0;
}
```