# Ввод и вывод

### Задание №7
- Сложность: средняя.

- Задание: напишите программу, которая считывает целое число `N`, а затем строку `str`, содержащую пробелы (до символа перевода строки). Число и строка находятся на разных строках (разделены `'\n'`). Затем выводит их через пробел в формате: `N str`. Важно: из-за буферизации после `scanf("%d", &N)` во входном буфере остаётся символ `'\n'`, не забудьте учесть это. Требования к программе:
  - Для ввода использует стандартные функции (`scanf`, `getchar`, `fgets`).  
  - Длина строки не превышает 100 символов.  
  - Выводит ровно одно число и строку, разделенные пробелом (допустим перевод строки в конце).   

- Уникальных значений нет.

- Ввод:
```
N
str
``` 
Вывод: `N str`. Пример программы:
```
#include <stdio.h>

int main()
{
    int N;
    char str[100];
    scanf("%d", &N);
    getchar();
    scanf("%[^\n]", str);
    printf("%d %s", N, str);
    return 0;
}
```