# Ввод и вывод

### Задание №3
- Сложность: легкая.

- Задание: напишите программу, которая выводит строку `S`, используя для этого функцию `function`.      

- Уникальными становятся значения `S`, `function` (`printf` или `puts`).

- Ввод: пуст. Вывод при `S = Hello world`, `function = printf`:
```
#include <stdio.h>

int main()
{
    printf("%s", "Hello world");
    return 0;
}
```